<table align="center" width=100%>
    <tr>
        <td width="15%">
            <img src="homework.png">
        </td>
        <td>
            <div align="center">
                <font color="#21618C" size=8px>
                    <b> PDS Mini Project 2 <br>
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

Shafeenafarheen Jageerhussain

##### Add comments and inferences about the solutions.

### 1. Create a dictionary named 'europe_dict' which has names of countries in europe, their capital and their population.

europe_dict = {
       "Country":["Spain","France","Germany","Norway"],
       "Capital":["Madrid","Paris","Berlin","Oslo"],
       "Population":[46.77,66.03,80.62,5.084]
}

In [2]:
#Importing the pandas library for the purpose of creating a dataframe using the "europe_dict" dictionary.
import pandas as pd

#Create a dictionary named "europe_dict" which has names of countries in europe, their capital and their population.
europe_dict = {
       "Country":["Spain","France","Germany","Norway"],
       "Capital":["Madrid","Paris","Berlin","Oslo"],
       "Population":[46.77,66.03,80.62,5.084]
}

#Creating the "df_europe" pandas dataframe from the features in "europe_dict" dictionary.
#As the index is not customized, it follows the default values of 0, 1, 2,....,n
df_europe = pd.DataFrame(europe_dict)

#Prints to the shape (rows, cols), info and datatypes of the features from the custom dataframe called "df_europe"
print("Shape:",df_europe.shape,"\n")
print(df_europe.info())
print("\nData Types:\n",df_europe.dtypes)

#Displays the first 5 observations / rows from the custom dataframe called "df_europe"
df_europe.head()

Shape: (4, 3)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Country     4 non-null      object
 1   Capital     4 non-null      object
 2   Population  4 non-null      float64
dtypes: float64(1), object(2)
memory usage: 224.0+ bytes
None

Data Types:
 Country        object
Capital        object
Population    float64
dtype: object

   Country Capital  Population
0    Spain  Madrid      46.770
1   France   Paris      66.030
2  Germany  Berlin      80.620
3   Norway    Oslo       5.084

#### Inferences:
Dataframe called "df_europe" has been created by using "europe_dict" dictionary which contains 3 features - i.e., Country, Capital and Population.

### 2. Use the data from question 1 and add a new column 'FamousFor'. The column should indicate what each country is famous for.

**Note:** Assigning a column that doesnâ€™t exist will create a new column.

In [3]:
#Creating a custom dictionary called "famour_for" with "Country" as key and "Famous" items as value pair list
famour_for = {"Spain":"Bullfights","France":"The Eiffel Tower","Germany":"Beer","Norway":"Midnight Sun"}

#Mapping the "value" of custom dictionary based on the look-up "key" (i.e., country) to a new feature called as "Famous For"
df_europe["Famous For"] = df_europe["Country"].map(famour_for) 

#Displays the first 5 observations / rows from the custom dataframe called "df_europe", incl. the newly created column.
df_europe.head()

   Country Capital  Population        Famous For
0    Spain  Madrid      46.770        Bullfights
1   France   Paris      66.030  The Eiffel Tower
2  Germany  Berlin      80.620              Beer
3   Norway    Oslo       5.084      Midnight Sun

#### Inferences:
A dictionary called "famous_for" that has key (i.e., Country) and value (i.e., Famous places / events etc.) pair, has been mapped as an input for the dataframe created earlier (i.e., df_europe). As the "Famous For" feature doesn't already exist in the df, it creates a new column by default to assign the value.

### 3. Use the data created in question 1, to do the following: 
#### Access column 'Captial' by specifying the column number.
#### Access column 'Population' by specifying the column name.
#### Access a country information

In [8]:
#1) Accessing the column called "Captial" by specifying the column number, using "index location" based access method.

#[:,1:2] ==> Performing the below operations in the dataframe:
#  a. Slicing (i.e., ":") though all the rows by using its indinces
#  b. Selecting only the second column (i.e., 1:2, where 1 is included and 2 is excluded) by using the column index

df_europe.iloc[:,1:2]

  Capital
0  Madrid
1   Paris
2  Berlin
3    Oslo

In [5]:
#2) Accessing the column called "Population" by specifying the column name, using "label location" based access method.

#[:,["Population"]] ==> Performing the below operations in the dataframe:
#  a. Slicing (i.e., ":") though all the rows by using its indices
#  b. Selecting only the "Population" column by using the column label index

df_europe.loc[:,["Population"]]

   Population
0      46.770
1      66.030
2      80.620
3       5.084

In [7]:
#3) Accessing the "France" country's information by slicing through the row label, using "direct access" method.

#[1:2] ==> Returns only the 2nd row from the df_europe dataframe.
#Start position (i.e., 1 ==> 2nd row) is included and end position (2 ==> 3rd row) is excluded.

df_europe[1:2]

  Country Capital  Population        Famous For
1  France   Paris       66.03  The Eiffel Tower

#### Inferences:
The required rows and columns from the df_europe dataframe has been accessed using either one of the 3 available methods (i.e., Direct Access, Label Location, Index Location) to display the expected output.

#### Question #1. 
Index Location based access method was used, where .iloc[:,1:2] does the below operations in the dataframe:
a. Slices (i.e., ":") though all the rows by using its indinces
b. Selects only the second column (i.e., 1:2, where 1 is included and 2 is excluded) by using the column index.

#### Question #2.
Label Location based access method was used, where .loc[:,["Population"]] does the below operations in the dataframe:
a. Slices (i.e., ":") though all the rows by using its indices
b. Selects only the "Population" feature by using the column label index

#### Question #3.
Direct Access method was used, where [1:2] returns only the 2nd row from the df_europe dataframe.

	
### 4. Read a csv file "example.csv", print it and also check its dimensions

In [13]:
#Reading the example.csv file's dataset using a pandas method called ".read_csv()"
df_examples = pd.read_csv(r"example.csv")

#Prints the Shape (i.e., rows, columns), Dimension (i.e., 1D, 2D etc.), Info and Data Types of the df_examples dataframe
print("Shape:",df_examples.shape)
print("\nDimension:",df_examples.ndim)
print("\nInfo:")
print(df_examples.info())
print("\nData Types:\n",df_examples.dtypes)

#Displays the first 5 rows from the df_examples dataframe
df_examples.head()

Shape: (10, 3)

Dimension: 2

Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Product ID     10 non-null     object
 1   Cost Price     10 non-null     int64
 2   Selling Price  10 non-null     int64
dtypes: int64(2), object(1)
memory usage: 368.0+ bytes
None

Data Types:
 Product ID       object
Cost Price        int64
Selling Price     int64
dtype: object

  Product ID  Cost Price  Selling Price
0       45SD          60            135
1       12PO          43            121
2       54PL          78            150
3       26PL          65            121
4       68HG          50            132

#### Inferences:
Methods / properties of pandas like .shape, .ndim, .info(), dtypes are used to determine the shape (rows, columns - i.e., 10,3 in this example), dimension (1D, 2D etc. - i.e., 2 in this ex.), data type (Product ID is object; Cost >Price and Selling Price are int64 in this ex.) and non-null (0 null values in this ex.) information.

### 5. Create a new column BMI, calculate the BMI of persons based on their weight and height.

In [22]:
#Creating a new dataframe called "df_bmi" with 3 features - i.e., Name, Height and Weight
df_bmi = pd.DataFrame(
    {
     'Name':['Venkat','Ajitha','Samyuktha','Yash'],
     'Height':[180,160,170,160],
     'Weight':[85,65,70,50]
    }
)

#Calculating the BMI for the given users based on their height and weight and storing the same under "BMI" feature
#Rounding off the output values - i.e., BMI to 2 decimal places
df_bmi['BMI'] = round(df_bmi.apply(lambda data : data.Weight / (data.Height/100)**2 , axis=1),2)

df_bmi.head()

        Name  Height  Weight    BMI
0     Venkat     180      85  26.23
1     Ajitha     160      65  25.39
2  Samyuktha     170      70  24.22
3       Yash     160      50  19.53

#### Inferences:

A new dataframe called "df_bmi" is created with the 3 features - i.e., Name, Height and Weight with some values assumed for calcuating the BMI (i.e., Kg / m^2). The heights given in cm in this example is converted into m by dividing the same with 100. After computation of the BMI values, the figure is rounded off to 2 decimal places and the same has been shown in the final output above.

Below chart shows the generally observed BMI ranges and the corresponding status:
##### S.No. | BMI Weight | Status
1 | Below 18.5 | Underweight

2 | 18.5 - 24.9 | Normal

3 | 25.0 - 29.9 | Overweight

4 | 30.0 - above | Obese

By comparing the above BMI chart with the output received, Venkat's and Ajitha's BMI statuses are "Overweight" and Samyuktha's and Yash's statuses are "Normal".

### 6. Create a pandas series having values 4, 7, -5, 3, NAN and their index as d, b, a, c, e

In [30]:
#Importing the numpy library for creating an empty value or Nan in the mylist1 / mydict1.
import numpy as np

#a) Creating using index and values lists (i.e., indexlist and mylist1):
mylist1 = [4,7,-5,3,np.NaN]
indexlist = ["d","b","a","c","e"]

#Passing the index and values lists as the input for creating the pandas series ps51_list
ps51_list = pd.Series(mylist1, index=indexlist)

#Prints the outcome of ps51_list series
print("Creating the series using lists:\n",ps51_list)

#b) Creating the Series using dictionary (i.e., mydict1):
mydict1 = {'d':4,'b':7,'a':-5,'c':3,'e':np.nan}

#Passing the dictionary mydict1 as the input for creating the pandas series ps51_dict
ps51_dict = pd.Series(mydict1)

#Prints the outcome of ps51_dict series
print("\nCreating the series using dictionary:\n",ps51_dict)

Creating the series using lists:
 d    4.0
b    7.0
a   -5.0
c    3.0
e    NaN
dtype: float64

Creating the series using dictionary:
 d    4.0
b    7.0
a   -5.0
c    3.0
e    NaN
dtype: float64

#### Inferences:
Series are created using the below 2 ways by passing:

Option 1: the index and values lists as an input

Option 2: the dictionary as an input

### 7. Using the series in question 6, find:                       
#### Find the minimum of all values
#### Find the maximum of all value

In [33]:
#Calculating and printing the minimum value from the ps51_list series
print("The minimum value from ps51_list is", ps51_list.min())

The minimum value from ps51_list is -5.0

In [35]:
#Calculating and printing the maximum value from the ps51_dict series
print("The maximum value from ps51_dict is", ps51_dict.max())

The maximum value from ps51_dict is 7.0

#### Inferences:
The .min() and .max() are the methods in the pandas series, where the 'min' gives the minimum value and the 'max' gives the maximum value in the series, by skipping the Nan / empty values.

Applying the logic to the series framed in the previous question, the minimum of all values is -5.0 and the maximum of all values is 7.0

### 8. Using the series in question 6, sort: 
#### the values in ascending order
#### the values in decending order

In [38]:
#Sorting the ps51_list series in ascending order

#.sort_values() without passing the order, does the below by default unless specified explicitly:
#a. sorts the values in ascending order
#b. positions the Nan value atlast

ps51_list.sort_values()

a   -5.0
c    3.0
d    4.0
b    7.0
e    NaN
dtype: float64

In [37]:
#Sorting the ps51_list series in ascending order by positioning the Nan values at the beginning (i.e., na_position = 'first'):

ps51_list.sort_values(na_position='first')

e    NaN
a   -5.0
c    3.0
d    4.0
b    7.0
dtype: float64

In [39]:
#Sorting the ps51_list series in descending order (i.e., ascending = False):

ps51_list.sort_values(ascending=False)

b    7.0
d    4.0
c    3.0
a   -5.0
e    NaN
dtype: float64

In [40]:
#Sorting the ps51_list series in descending order (i.e., ascending = False),
                 #by positioning the Nan values at the beginning (i.e., na_position = 'first'):

ps51_list.sort_values(ascending = False,na_position='first')

e    NaN
b    7.0
d    4.0
c    3.0
a   -5.0
dtype: float64

#### Inferences:

The sort_values method is used to sort (ascending by default) and to position the Nan (at last by default) in the series.

The elements of the series can be sorted in descending order by passing the parameter "ascending = False" and keeps the null value at last. The NaN can also be placed first during sorting by passing the parameter "na_position = 'first'" to the sort values function.

### 9. Find duplicate rows based on selected column ('Name')

**Use the data frame given below:**
 

<table>
<tr>
<th>Name</th>
<th>Salary</th>
<th>City</th>
</tr>
<tr>
<td>John</td>
<td>3400</td>
<td>Sydeny</td>
</tr>
<tr>
<td>Robert</td>
<td>3000</td>
<td>Chicago</td>
</tr>
<tr>
<td>Aadi</td>
<td>1600</td>
<td>New York</td>
</tr>
<tr>
<td>Robert</td>
<td>3000</td>
<td>Chicago</td>
</tr>
<tr>
<td>Robert</td>
<td>3000</td>
<td>Chicago</td>
</tr>
<tr>
<td>Robert</td>
<td>3000</td>
<td>Texas</td>
</tr>
<tr>
<td>Aadi</td>
<td>4000</td>
<td>London</td>
</tr>
<tr>
<td>Sachin</td>
<td>3000</td>
<td>Chicago</td>
</tr>
</table>

In [42]:
#Creating a dictionary called "employee_details"
employee_details = {
       "Name":["John","Robert","Aadi","Robert","Robert","Robert","Aadi","Sachin"],
       "Salary":[3400,3000,1600,3000,3000,3000,4000,3000],
       "City":["Sydney","Chicago","New York","Chicago","Chicago","Texas","London","Chicago"]
}

#Passing the dictionary created above as an input of the dataframe called "df83" (with 8 rows and 3 columns)
df83 = pd.DataFrame(employee_details)

#Identifying the duplicate rows using .duplicated() method by:
#a. passing the column name in subset
#b. the item that needs to be detected as duplicate
#   keep = 'first' ==> assumes the first occurence in the given subset as non-duplicate record
#   similarly we can apply keep = 'last' or False, to go for other combinations

#The output of the .duplicated() method (i.e., True / False) is once again passed to the dataframe df83 itself, 
                           #to diplay the non-duplicated records / rows
df83[df83.duplicated(subset=["Name"], keep="first")]

     Name  Salary     City
3  Robert    3000  Chicago
4  Robert    3000  Chicago
5  Robert    3000    Texas
6    Aadi    4000   London

#### Inferences:

The duplicated method along with the column name 'Name' which is passed as the parameter is used to find the duplicate rows for that specific column. By default, it treats the first occurance of the repeated value to be original and rest of the occurance to be duplicate.

Similarly, the last occurance of the repeated value can be made as original and rest to be duplicate by passing the parameter "keep = 'last'" to the duplicated function. To return all the occurance of the duplicate values, pass "keep = False".

### 10. Get the descriptive statistics of the sales for each season

**Use the data frame given below:**
   
<table>
<tr>
<th>Month</th>
<th>Sales</th>
<th>Seasons</th>
</tr>
<tr>
<td>Jan</td>
<td>22000</td>
<td>Winter</td>
</tr>
<tr>
<td>Feb</td>
<td>27000</td>
<td>Winter</td>
</tr>
<tr>
<td>Mar</td>
<td>25000</td>
<td>Spring</td>
</tr>
<tr>
<td>Apr</td>
<td>29000</td>
<td>Spring</td>
</tr>
<tr>
<td>May</td>
<td>35000</td>
<td>Spring</td>
</tr>
<tr>
<td>June</td>
<td>67000</td>
<td>Summer</td>
</tr>
<tr>
<td>July</td>
<td>78000</td>
<td>Summer</td>
</tr>
<tr>
<td>Aug</td>
<td>67000</td>
<td>Summer</td>
</tr>
<tr>
<td>Sep</td>
<td>56000</td>
<td>Fall</td>
</tr>
<tr>
<td>Oct</td>
<td>56000</td>
<td>Fall</td>
</tr>
<tr>
<td>Nov</td>
<td>56000</td>
<td>Fall</td>
</tr>
<tr>
<td>Dec</td>
<td>60000</td>
<td>Winter</td>
</tr>

</table>

In [44]:
#Creating a dictionary called "sales_trend"
sales_trend = {
       "Month":["Jan","Feb","Mar","Apr","May","June","July","Aug","Sep","Oct","Nov","Dec"],
       "Sales":[22000,27000,25000,29000,35000,67000,78000,67000,56000,56000,56000,60000],
       "Seasons":["Winter","Winter","Spring","Spring","Spring","Summer","Summer","Summer","Fall","Fall","Fall","Winter"]
}

#Passing the dictionary created above as an input of the dataframe called "df12_3" (with 12 rows and 3 columns)
df12_3 = pd.DataFrame(sales_trend)

#Prints the dataframe (i.e., df12_3) output which is created using the dictionary (i.e., sales_trend)
df12_3

   Month  Sales Seasons
0    Jan  22000  Winter
1    Feb  27000  Winter
2    Mar  25000  Spring
3    Apr  29000  Spring
4    May  35000  Spring
5   June  67000  Summer
6   July  78000  Summer
7    Aug  67000  Summer
8    Sep  56000    Fall
9    Oct  56000    Fall
10   Nov  56000    Fall
11   Dec  60000  Winter

In [45]:
#Grouping the records based on "Season" feature and applying the .describe() function on "Sales" Feature
df12_3.groupby(by='Seasons')['Sales'].describe()

,count,mean,std,min,25%,50%,75%,max
Seasons,,,,,,,,
Fall,3.0,56000.000000,0.000000,56000.0,56000.0,56000.0,56000.0,56000.0
Spring,3.0,29666.666667,5033.222957,25000.0,27000.0,29000.0,32000.0,35000.0
Summer,3.0,70666.666667,6350.852961,67000.0,67000.0,67000.0,72500.0,78000.0
Winter,3.0,36333.333333,20647.840888,22000.0,24500.0,27000.0,43500.0,60000.0

#### Inferences:

The statistical measure is calculated using the describe function, which by default provides the stats. measure only for numerical data. However, we can get the descriptive stats. for all types (i.e., numerical and categorical) of features by using .describe(include="all").

In the above example, the "Seasons" feature is grouped using .groupby(by="") and the .describe() method is applied on the "Sales" feature (i.e., numerical columns) to find the descriptive statistics of the sales for each season.

### 11. Combine the new column age in the below data frame

**Use the data frame given below:**
   
<table>
<tr>
<th>Name</th>
<th>Maths</th>
<th>Science</th>
<th>English</th>
</tr>
<tr>
<td>Emma</td>
<td>56</td>
<td>89</td>
<td>89</td>
</tr>
<tr>
<td>Mia</td>
<td>78</td>
<td>87</td>
<td>89</td>
</tr>
<tr>
<td>Sophia</td>
<td>78</td>
<td>78</td>
<td>76</td>
</tr>
<tr>
<td>James</td>
<td>67</td>
<td>89</td>
<td>78</td>
</tr>
<td>John</td>
<td>88</td>
<td>78</td>
<td>87</td>
</tr>
   
</table>

In [49]:
#Creating a dictionary called "student_marks"
student_marks = {
    'Name':['Emma','Mia','Sophia','James','John'],
    'Maths':[56,78,78,67,88],
    'Science':[89,87,78,89,78],
    'English':[89,89,76,78,87]
}

#Passing the dictionary created above as an input of the dataframe called "df54" (with 5 rows and 4 columns)
student_db = pd.DataFrame(student_marks)

#Prints the dataframe (i.e., student_db) output which is created using the dictionary (i.e., student_marks)
student_db

     Name  Maths  Science  English
0    Emma     56       89       89
1     Mia     78       87       89
2  Sophia     78       78       76
3   James     67       89       78
4    John     88       78       87

In [50]:
#Creating a dictionary called "student_age"
student_age = {'Emma': 15 , 'Mia':16 , 'Sophia':15 , 'James': 15 ,'John': 16}

#Mapping the "value" (i.e., Age) of custom dictionary based on the look-up "key" (i.e., Name) to a new feature called as "Age"
student_db['Age'] = student_db["Name"].map(student_age)

#Prints the dataframe (i.e., student_db) output which is created using the dictionary (i.e., student_marks) 
                            #along with the "Age" mapped from another dictionary (i.e., student_age)
student_db

     Name  Maths  Science  English  Age
0    Emma     56       89       89   15
1     Mia     78       87       89   16
2  Sophia     78       78       76   15
3   James     67       89       78   15
4    John     88       78       87   16

#### Inferences:

The new dataframe called "student_db" is created using the dictionary 1 - "student_marks", which is then mapped to dictionary 2 - "student_age" using the "Name" key value, to store the student age in a new column / feature called as "Age".

### 12.Concatenate two data frames along with the columns

**Use the data frame given below:**
   
<table>
<tr>
<th>ID</th>
<th>Name</th>
<th>Subject</th>
</tr>
<tr>
<td>101</td>
<td>Alex</td>
<td>Maths</td>
</tr>
<tr>
<td>102</td>
<td>Amy</td>
<td>English</td>
</tr>
<tr>
<td>103</td>
<td>Allen</td>
<td>Science</td>
</tr>
<tr>
<td>104</td>
<td>Alice</td>
<td>German</td>
</tr>
<td>105</td>
<td>Ayoung</td>
<td>History</td>
</tr>
   
</table><br>



<table>
<tr>
<th>ID</th>
<th>Name</th>
<th>Subject</th>
</tr>
<tr>
<td>101</td>
<td>Billy</td>
<td>English</td>
</tr>
<tr>
<td>102</td>
<td>Brian</td>
<td>Science</td>
</tr>
<tr>
<td>103</td>
<td>Bran</td>
<td>Social Science</td>
</tr>
<tr>
<td>104</td>
<td>Bryce</td>
<td>German</td>
</tr>
<td>105</td>
<td>Betty</td>
<td>History</td>
</tr>
   
</table>

In [55]:
#Creating a dictionary called "dictionary_1"
dictionary_1 = {
    'ID':[101,102,103,104,105],
    'Name':['Alex','Amy','Allen','Alice','Ayoung'],
    'Subject':['Maths','English','Science','German','History']
}

#Passing the dictionary created above as an input of the dataframe called "df_1" (with 5 rows and 3 columns)
df_1 = pd.DataFrame(dictionary_1)

#Prints the dataframe (i.e., df_1) output which is created using the dictionary (i.e., dictionary_1)
df_1

    ID    Name  Subject
0  101    Alex    Maths
1  102     Amy  English
2  103   Allen  Science
3  104   Alice   German
4  105  Ayoung  History

In [53]:
#Creating a dictionary called "dictionary_2"
dictionary_2 = {
    'ID':[101,102,103,104,105],
    'Name':['Billy','Brian','Bran','Bryce','Betty'],
    'Subject':['English','Science','Social Science','German','History']
}

#Passing the dictionary created above as an input of the dataframe called "df_2" (with 5 rows and 3 columns)
df_2 = pd.DataFrame(dictionary_2)

#Prints the dataframe (i.e., df_2) output which is created using the dictionary (i.e., dictionary_2)
df_2

    ID   Name         Subject
0  101  Billy         English
1  102  Brian         Science
2  103   Bran  Social Science
3  104  Bryce          German
4  105  Betty         History

In [54]:
#Concating both the dataframes (i.e., df_1 and df_2) vertically
#Resetting the index (0,1,2,3,4,0,1,2,3,4 ==> 0,1,2,3,4,5,6,7,8,9) using ignore_index =True
pd.concat(objs=(df_1,df_2), ignore_index= True)

    ID    Name         Subject
0  101    Alex           Maths
1  102     Amy         English
2  103   Allen         Science
3  104   Alice          German
4  105  Ayoung         History
5  101   Billy         English
6  102   Brian         Science
7  103    Bran  Social Science
8  104   Bryce          German
9  105   Betty         History

#### Inferences:

In the above example, .concat() method is used to concatenate two dataframes (df_1 and df_2) vertically (i.e., axis=0 or
column). To avoid having the repeating index for each concatenated dataframes (i.e., the original index), the parameter "ignore_index= True" is passed to get a new continuous auto-assigned index (0, 1, 2, ............9)